## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.conception-alpha-canada-ca-A will be created
  + resource "aws_route53_record" "conception-alpha-canada-ca-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "conception.alpha.canada.ca"
      + records         = [
          + "52.237.15.42",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.design-alpha-canada-ca-A will be updated in-place
  ~ resource "aws_route53_record" "design-alpha-canada-ca-A" {
        fqdn    = "design.alpha.canada.ca"
        id      = "Z33C47YI9EN8XL_design.alpha.canada.ca_CNAME"
        name    = "design.alpha.canada.ca"
      ~ records = [
          + "52.237.15.42",
          - "gallant-bassi-851d24.netlify.app",
        ]
        ttl     = 300
      ~ type    = "CNAME" -> "A"
        zone_id = "Z33C47YI9EN8XL"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

19 tests, 16 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
